{
  "class_name": "Functional",
  "config": {
    "name": "model",
    "trainable": true,
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            30,
            19
          ],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_1"
        },
        "name": "input_1",
        "inbound_nodes": []
      },
      {
        "class_name": "LSTM",
        "config": {
          "name": "lstm",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 64,
          "activation": "relu",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "recurrent_initializer": {
            "module": "keras.initializers",
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 2
        },
        "name": "lstm",
        "inbound_nodes": [
          [
            [
              "input_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LSTM",
        "config": {
          "name": "lstm_1",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": false,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 32,
          "activation": "relu",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "recurrent_initializer": {
            "module": "keras.initializers",
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 2
        },
        "name": "lstm_1",
        "inbound_nodes": [
          [
            [
              "lstm",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "RepeatVector",
        "config": {
          "name": "repeat_vector",
          "trainable": true,
          "dtype": "float32",
          "n": 30
        },
        "name": "repeat_vector",
        "inbound_nodes": [
          [
            [
              "lstm_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LSTM",
        "config": {
          "name": "lstm_2",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 32,
          "activation": "relu",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "recurrent_initializer": {
            "module": "keras.initializers",
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 2
        },
        "name": "lstm_2",
        "inbound_nodes": [
          [
            [
              "repeat_vector",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "LSTM",
        "config": {
          "name": "lstm_3",
          "trainable": true,
          "dtype": "float32",
          "return_sequences": true,
          "return_state": false,
          "go_backwards": false,
          "stateful": false,
          "unroll": false,
          "time_major": false,
          "units": 64,
          "activation": "relu",
          "recurrent_activation": "sigmoid",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "recurrent_initializer": {
            "module": "keras.initializers",
            "class_name": "Orthogonal",
            "config": {
              "gain": 1.0,
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "unit_forget_bias": true,
          "kernel_regularizer": null,
          "recurrent_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "recurrent_constraint": null,
          "bias_constraint": null,
          "dropout": 0.0,
          "recurrent_dropout": 0.0,
          "implementation": 2
        },
        "name": "lstm_3",
        "inbound_nodes": [
          [
            [
              "lstm_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "class_name": "TimeDistributed",
        "config": {
          "name": "time_distributed",
          "trainable": true,
          "dtype": "float32",
          "layer": {
            "module": "keras.layers",
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 19,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "registered_name": null
          }
        },
        "name": "time_distributed",
        "inbound_nodes": [
          [
            [
              "lstm_3",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_1",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "time_distributed",
        0,
        0
      ]
    ]
  }
}